; domain
;; Archivo: domain.pddl
(define (domain rover-laboratory)
  (:requirements :strips :typing)
  (:types location rock)
  (:predicates
    (robot-at ?l - location)
    (rock-at ?r - rock ?l - location)
    (carrying ?r - rock)
    (lab ?l - location)
    (connected ?from - location ?to - location)
  )

  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and (robot-at ?from) (connected ?from ?to))
    :effect (and (not (robot-at ?from)) (robot-at ?to))
  )

  (:action pick
    :parameters (?r - rock ?l - location)
    :precondition (and (robot-at ?l) (rock-at ?r ?l) (not (carrying ?r)))
    :effect (and (not (rock-at ?r ?l)) (carrying ?r))
  )

  (:action drop
    :parameters (?r - rock ?l - location)
    :precondition (and (robot-at ?l) (carrying ?r) (lab ?l))
    :effect (and (not (carrying ?r)) (rock-at ?r ?l))
  )
)

; problem
;; Archivo: problem.pddl
(define (problem transport-rocks-to-lab)
  (:domain rover-laboratory)
  (:objects
    loc1 loc2 loc3 loc4 loc5 - location
    rock1 rock2 - rock
  )
  (:init
    ;; Conexiones según el enunciado
    ;; 3 <-> 1
    (connected loc3 loc1)
    (connected loc1 loc3)
    ;; 3 -> 2 (solo una dirección)
    (connected loc3 loc2)
    ;; 2 -> 4 (solo una dirección)
    (connected loc2 loc4)
    ;; 3 <-> 4
    (connected loc3 loc4)
    (connected loc4 loc3)
    ;; 4 <-> 5
    (connected loc4 loc5)
    (connected loc5 loc4)

    ;; Posición inicial del robot (asumimos localidad 3)
    (robot-at loc3)

    ;; Rocas ya excavadas en sus localidades
    (rock-at rock1 loc1)
    (rock-at rock2 loc2)

    ;; Laboratorio en localidad 5
    (lab loc5)
  )
  (:goal
    (and
      (rock-at rock1 loc5)
      (rock-at rock2 loc5)
    )
  )
)

; plan
1. (move loc3 loc1)
   deleted: (robot-at loc3)
   added: (robot-at loc1)
   goals met: 0 of 2
2. (pick rock1 loc1)
   deleted: (rock-at rock1 loc1)
   added: (carrying rock1)
   goals met: 0 of 2
3. (move loc1 loc3)
   deleted: (robot-at loc1)
   added: (robot-at loc3)
   goals met: 0 of 2
4. (move loc3 loc2)
   deleted: (robot-at loc3)
   added: (robot-at loc2)
   goals met: 0 of 2
5. (pick rock2 loc2)
   deleted: (rock-at rock2 loc2)
   added: (carrying rock2)
   goals met: 0 of 2
6. (move loc2 loc4)
   deleted: (robot-at loc2)
   added: (robot-at loc4)
   goals met: 0 of 2
7. (move loc4 loc5)
   deleted: (robot-at loc4)
   added: (robot-at loc5)
   goals met: 0 of 2
8. (drop rock1 loc5)
   deleted: (carrying rock1)
   added: (rock-at rock1 loc5)
   goals met: 1 of 2
9. (drop rock2 loc5)
   deleted: (carrying rock2)
   added: (rock-at rock2 loc5)
   goals met: 2 of 2
